---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CurveElemArcRange
source: html/383bc232-e1fe-e470-44c1-9f777b065adb.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CurveElemArcRange Property

"Range"

## Syntax (C#)
```csharp
public static ForgeTypeId CurveElemArcRange { get; }
```